app/views/wars/_form.html.haml

SELECT  "users".* FROM "users" INNER JOIN "register_tournois" ON "users"."id" = "register_tournois"."user_id" WHERE "register_tournois"."tournoi_id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["tournoi_id", 19]]
SELECT "wars".* FROM "wars"  WHERE "wars"."tournoi_id" = $1  [["tournoi_id", 19]]
---
    = f.label :joueur1
    = select("war", "user_1_id", @tournoi.users.collect {|p| [ p.name, p.id ] }, {include_blank: true})
  .field

SELECT "games".* FROM "games" INNER JOIN "tournoi_games" ON "games"."id" = "tournoi_games"."game_id" WHERE "tournoi_games"."tournoi_id" = $1  [["tournoi_id", 19]]
---
    = f.label :game
    = select("war", "game_id", @tournoi.games.collect {|p| [ p.title, p.id ] }, {include_blank: true})