app/views/tournois/_form.html.haml

SELECT "games".id FROM "games" INNER JOIN "tournoi_games" ON "games"."id" = "tournoi_games"."game_id" WHERE "tournoi_games"."tournoi_id" = $1  [["tournoi_id", 10]]
---
    - @games.each do |game|
      = check_box_tag("tournoi[game_ids][]", game.id , @tournoi.game_ids.include?(game.id))