app/views/tournois/_ranking.html.haml

SELECT "users".* FROM "users" INNER JOIN "register_tournois" ON "users"."id" = "register_tournois"."user_id" WHERE "register_tournois"."tournoi_id" = $1  [["tournoi_id", 19]]
SELECT "wars".* FROM "wars"  WHERE "wars"."tournoi_id" = $1  [["tournoi_id", 19]]
---
- @tournoi.users.each do |tu|
	- @tournoi.wars.each do |tw|