app/views/tournois/index.html.haml

    .col-md-1
      = tournoi.users.count
    .col-md-2
---
SELECT COUNT(*) FROM "users" INNER JOIN "register_tournois" ON "users"."id" = "register_tournois"."user_id" WHERE "register_tournois"."tournoi_id" = $1  [["tournoi_id", 17]]