app/views/tournois/show.html.haml

  %br
  - @tournoi.games.each do |tg|
---
SELECT "games".* FROM "games" INNER JOIN "tournoi_games" ON "games"."id" = "tournoi_games"."game_id" WHERE "tournoi_games"."tournoi_id" = $1  [["tournoi_id", 10]]

    - @var = 1
    - wars = @tournoi.wars.where(game_id: tg.id)
---
SELECT "wars".* FROM "wars"  WHERE "wars"."tournoi_id" = $1 AND "wars"."game_id" = 2  [["tournoi_id", 19]]

                    - @var +=1
                  %td=User.find(tw.user_1_id).email
---
SELECT "users".* FROM "users" INNER JOIN "register_tournois" ON "users"."id" = "register_tournois"."user_id" WHERE "register_tournois"."tournoi_id" = $1  [["tournoi_id", 17]]

                  - if tw.scorej1.blank?
                    = form_for [@tournoi,@tournoi.wars.find(tw)], :remote => true do |f|
---
SELECT "wars".* FROM "wars"  WHERE "wars"."tournoi_id" = $1  [["tournoi_id", 19]]