app/controllers/games_controller.rb

	def create
		@game = current_user.games.new(game_params)
		if @game.save
---
INSERT INTO "games" ("description", "title") VALUES ($1, $2) RETURNING "id"  [["description", "il faut faire la plus belle suite de dominos"], ["title", "Domino"]]

	def index
    	@game = Game.all
---
SELECT  "games".* FROM "games"   ORDER BY "games"."id" ASC LIMIT 1

  def update
    @game = current_user.games.find(params[:id])
  	if @game.update_attributes(game_update)
---
SELECT  "games".* FROM "games"  WHERE "games"."user_id" = $1 AND "games"."id" = $2 LIMIT 1  [["user_id", 11], ["id", 3]]
UPDATE "games" SET "description" = $1, "title" = $2 WHERE "games"."id" = 3  [["description", "Un carré d'as et le tour est joué !"], ["title", "Poker"]]