app/controllers/rankings_controller.rb

	def index
		@tournois = Tournoi.all
		@games = Game.all
		@wars = War.all
		@users = User.all
		@tabG = []
		@games.each do |g|
			tab = []
			@users.each do |u|
				score = 0
		    	score = @wars.where(user_1_id: u.id,game_id: g.id).sum(:scoreJ1) + @wars.where(user_2_id: u.id,game_id: g.id).sum(:scoreJ2)
				w = 0
				n = 0
				l = 0
				@wars.where(user_1_id: u.id,game_id: g.id).each do |sc|
					if sc.scoreJ1 == 3
						w +=1
					end
					if sc.scoreJ1 == 1
						n +=1
					end
					if sc.scoreJ1 == 0
						l +=1
					end
				end

				@wars.where(user_2_id: u.id,game_id: g.id).each do |sc|
---
SELECT "tournois".* FROM "tournois"
SELECT "games".* FROM "games"
SELECT "users".* FROM "users"
SELECT "wars".* FROM "wars"  WHERE "wars"."user_1_id" = 10 AND "wars"."game_id" = 2
SELECT SUM("wars"."scoreJ1") AS sum_id FROM "wars"  WHERE "wars"."user_1_id" = 13 AND "wars"."game_id" = 2
SELECT "wars".* FROM "wars"  WHERE "wars"."user_2_id" = 10 AND "wars"."game_id" = 2
SELECT SUM("wars"."scoreJ2") AS sum_id FROM "wars"  WHERE "wars"."user_2_id" = 13