app/controllers/rankings_controller.rb

	def index
		@tabG = []
		@games = Game.joins(:wars).where("wars.user_1_id IS NOT NULL").uniq
		@games.each do |game|
			tab = []
			game.users.each do |u|
				hash = {:name => 0,  :score => 0,:w => 0,:l => 0,:n => 0}
				w = 0
				l = 0
				n = 0
				hash[:score] = game.wars.where(user_1_id: u.id,game_id: game.id).sum(:scorej1) + game.wars.where(user_2_id: u.id,game_id: game.id).sum(:scorej2)
				game.wars.where('user_1_id=? OR user_2_id=?', u.id,u.id).each do |sc|
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 12  ORDER BY "users"."id" ASC LIMIT 1