app/controllers/registrations_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "name", "statut", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(sign_up_params)
		@user.statut = User::ADMIN
		if @user.save