app/controllers/tournois_controller.rb

  def index
    if user_signed_in?
      @tournois = Tournoi.all
---
SELECT "tournois".* FROM "tournois"

  def show
    set_tournoi
    @game = Game.all
---
SELECT "games".* FROM "games"

  def new
    @tournoi = Tournoi.new
    @games = Game.all
---
SELECT "games".* FROM "games"

  def edit
    @games = Game.all
---
SELECT "games".* FROM "games"

  def create
    @tournoi = Tournoi.new(tournoi_params)
    @war = @tournoi.wars
    if @tournoi.save
---
INSERT INTO "tournois" ("created_at", "date", "name", "nbPlayerMax", "place", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2015-02-11 11:34:03.187035"], ["date", "2015-03-11"], ["name", "Grand casino"], ["nbPlayerMax", 10], ["place", "Namur"], ["updated_at", "2015-02-11 11:34:03.187035"]]

  def update
    set_tournoi
    @games = Game.all
    if @tournoi.update_attributes(tournoi_params)
---
UPDATE "tournois" SET "nbPlayerMax" = $1, "updated_at" = $2 WHERE "tournois"."id" = 10  [["nbPlayerMax", 200], ["updated_at", "2015-02-12 15:08:20.694034"]]

  def destroy
    @tournoi.tournoi_games.where("tournoi_id = ?",params[:id]).delete_all
    @tournoi.register_tournois.where("tournoi_id = ?",params[:id]).delete_all
---
DELETE FROM "tournoi_games" WHERE "tournoi_games"."tournoi_id" = $1 AND (tournoi_id = '10')  [["tournoi_id", 10]]
DELETE FROM "tournois" WHERE "tournois"."id" = $1  [["id", 3]]
SELECT  "tournois".* FROM "tournois"  WHERE "tournois"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "register_tournois" WHERE "register_tournois"."tournoi_id" = $1 AND (tournoi_id = '17')  [["tournoi_id", 17]]

  def register
    @register_tournoi = RegisterTournoi.new
    @register_tournoi.user_id = current_user.id
    @register_tournoi.tournoi_id = params[:id]
    if @tournoi.nbPlayerMax > @tournoi.users.count
      if @register_tournoi.save
---
SELECT COUNT(*) FROM "users" INNER JOIN "register_tournois" ON "users"."id" = "register_tournois"."user_id" WHERE "register_tournois"."tournoi_id" = $1  [["tournoi_id", 17]]
INSERT INTO "register_tournois" ("tournoi_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["tournoi_id", 17], ["user_id", 11]]

    def set_tournoi
      @tournoi = Tournoi.find(params[:id])
---
SELECT  "tournois".* FROM "tournois"  WHERE "tournois"."id" = $1 LIMIT 1  [["id", 17]]