app/controllers/wars_controller.rb

	def create
		@war = War.new(war_params)
		@war.tournoi_id = @tournoi.id
		if @war.save
---
INSERT INTO "wars" ("created_at", "game_id", "scoreJ1", "scoreJ2", "tournoi_id", "updated_at", "user_1_id", "user_2_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["created_at", "2015-02-17 09:29:03.718809"], ["game_id", 5], ["scoreJ1", 3], ["scoreJ2", 0], ["tournoi_id", 19], ["updated_at", "2015-02-17 09:29:03.718809"], ["user_1_id", 11], ["user_2_id", 12]]

		def set_action
			@tournoi = Tournoi.find(params[:tournoi_id])
---
SELECT  "tournois".* FROM "tournois"  WHERE "tournois"."id" = $1 LIMIT 1  [["id", 19]]